app/controllers/students_controller.rb

  def create
    @student = Student.new(params[:student])
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-10-15 17:26:55.697802"], ["updated_at", "2017-10-15 17:26:55.697802"]]

  def update
    @student = Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]